Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures.SlabShapeWarnVerticesDeleted
Some slab shape edit vertices were deleted because the Floor or Roof or Toposolid has changed its shape.

Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures.SlabShapeFailedTooThin
The Floor or Roof or Toposolid is too thin for its given type.

Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures.SlabShapeFailedNotOnlyLines
The Floor or Roof or Toposolid may only contain straight lines.

Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures.SlabShapeFailedNotHorz
The Floor or Roof or Toposolid is no longer horizontal.